<template>
	<router-view>
	</router-view>
	<div class="not-mobile">
		not mobile
	</div>
</template>
<style lang="scss" src="@/assets/scss/app.scss">
</style>
<script>
/*
	Привет!
	-------------
	Сначала немного оффтопа про vue и настройки проекта:

	Во Vue нет понятия страниц и компонентов. Все является технически
	компонентами. То есть страницы в нашем случае - просто компоненты,
	которые мы захотели сделать страницами.

	На проекте новая версия vue, поэтому если что-то гуглим - гуглим
	про vue next, vue 3 и так далее. Многие либы, которые писались
	под vue 2 работают здесь не так как нужно
	-------------
	Структура папок:
	public - тут favicon или файлы, которые не нужно билдить 
		(чистый html, css). Вообще, не желательно что-либо сюда 
		добавлять (разве что набор иконок)

	src - тут все остальное, просто главная папка грубо говоря

	assets - тут хранятся наши ассеты, я сразу сделал базовые
		папки fonts, images и scss. Все общие картинки, шрифты
		- попадают сюда. Так же тут содержатся глобальные scss
		файлы:
			typography - отвечает за отображение текста (подумал
		это удобно), 
			variables (общие настройки цветосхем. лучше
		всегда юзать переменные цветов, а не сами цвета. 
			app - подключается в App.vue и работает как стили для всего 
		проекта))
			animations - объявляет тут анимации, которые могут
		далее использоваться в разных местах. Пример как использовать
		анимацию в верстке в views/main/index.vue на второй строке
		Тут мы юзаем анимацю fade на контент, который содержится внутри
		transition
	
	components - папка для переиспользуемых компонентов (то, из 
			чего должен собираться проект. например - кнопка, карточка,
			товар, колонка статьи)

	composables - js файлы, которые мы используем затем в разных
		местах. например - login.js, используется на странице регистрации
		и входа. это могут быть файлы с какими-то функциями и так далее,
		лучше всего называть так, какую роль выполняют

	routes - папка с единственным js файлом, отвечающим за навигацию
		Именно он отвечате за переход по разным страницам и путям. Чтобы
		добавить страницу, нужно заимпортить ее и вставить в массив routes

	store - папка для хранилищ. тут мы храним js файлы, в которых содержатся
		реактивные элементы. их мы используем между разными компонентами, 
		и все данные синхронизированы. можно посмотреть как store/user
		кидает даннеы между views/login и views/signin

	views - папка для компонентов-страниц, которые потом вставляются в роутер
		!ВАЖНО все компоненты (не только страницы, все компоненты вообще) 
		должны быть обязательно папкой, в которой на верхнем уровне лежит 
		index.vue. (это не техническое ограничение, а мое. поверьте - так будет
		лучше и удобнее) index.scss - кастомный. если стили не нужны, можно не подключать. подключается scss внизу .vue файла и импортится
	-------------
	Vue моменты и всякое:
			Dynamic Attributes
			Допустим у элемента есть атрибут placeholder статичный, чтобы сделать 
		его динамичным нужно сделать его :placeholder и написать в него либо
		переменную, либо функцию с return вот так <input :placeholder="password">
		и в password уже пишешь что хочешь. Так можно делать с ЛЮБЫМИ атрибутами

			Show/Hide element
		Элементам задаем атрибуты либо v-if, либо v-show, передаем им boolean.
		Пример использования views/main, 3 строка
		
			Props
		Передаваемые пропсы, передаются как аргумент. Пример кода views/main 5 строка,
		components/v-button 

			Lifecycle hooks
		Как юзать: https://v3.vuejs.org/guide/composition-api-lifecycle-hooks.html
		Какие бывают: https://ru.vuejs.org/images/lifecycle.png
		Пример в коде: views/main 18 строка импорт, 30 строка использование

			Components
		Импорт компонентов. Пример использования: views/main 17 строка импорт,
		40 строка регистрация, 5 строка использование

			Использование переменных и функций в вёрстке
		Нужно их объявить и return'ить, рекомендую использовать reactive (проще)
		Пример использования: views/main 18 строка (импорт reactive) 
		24 строка (объявление), 36 строка return, 3 строка использование

			Reactive/Ref
		ref: https://v3.vuejs.org/guide/composition-api-introduction.html#reactive-variables-with-ref
		reactive/ref: https://composition-api.vuejs.org/#ref-vs-reactive

			Watch (отслежвание изменений)
		https://composition-api.vuejs.org/api.html#watch

			Computed значения (когда нужно что-то посчитать), но не изменять само
		значение https://composition-api.vuejs.org/api.html#computed
	-------------
	На этом общая каша заканчивается, перейдем прост к частному.

		В этом файле у нас есть компонент <router-view>, это уже готовый компонент,
	который показывает тот компонент (проще говоря страницу), который сейчас
	активирован роутером. По дефолту открывается путь "/", если заглянуть в 
	router/index, то по пути "/" мы открываем views/main. Перейди туда
*/


export default {
	setup() {
	}
}
</script>